Autodesk.Revit.DB.AlternateUnits
An enumerated type listing the locations where Alternate units may be displayed in dimensions.

Autodesk.Revit.DB.AlternateUnits.Below
Alternative units display below the primary units.

Autodesk.Revit.DB.AlternateUnits.Right
Alternative units display to the right of the primary units.

Autodesk.Revit.DB.AlternateUnits.None
No alternative units.